tap "homebrew/bundle"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern and intuitive terminal-based text editor
brew "micro"
# Postgres C API library
brew "libpq", link: true
# SMART hard drive monitoring
brew "smartmontools"
# Graphical command-line client for SSH
brew "sshs"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Shell extension to navigate your filesystem faster
brew "zoxide"

cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Password manager that keeps all passwords secure behind one password
cask "1password"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Display management tool
cask "betterdisplay"
# Web browser
cask "firefox"
# Open-source code editor
cask "visual-studio-code"
# Keyboard configurator
cask "via"
# Video communication and virtual meeting platform
cask "zoom"
